Repository: SamuelSwartzberg/scripts
Catalog: sh/omega-init/project/tm/2019-11-02-Jet-Belt-omegat.tmx
Source language: de_de
Languages: en_us

source: ( Architekt Erich Gassmann, zu den 10 besten Showrooms gewählt von AIT, DETAIL 2007, 2008)
en_us: (Architect Erich Gassmann, selected among the 10 best showrooms by AIT, DETAIL 2007, 2008)

source: 2-Step-Safetybelt Mechanismus – KLICK-AUF, KLICK-ZU in Sekundenbruchteilen
en_us: 2-Step Safety-Belt Mechanism - CLICK to open and close within milliseconds

source: AVIATOR – Ausführung in Premium Nylon doppelseitig genäht mit Verstärkungsseele und Chrom Verschluß.
en_us: The AVIATOR: Made with reinforced premium nylon and a chrome buckle.

source: Alle Gürtel sind kompromisslos hochwertig.
en_us: All belts feature superior quality without compromises.

source: Alle Gürtel und Verschlüsse werden aus den besten Materialien hergestellt und handgefertigt, um unseren Ansprüchen an einen Premium-Gürtel gerecht zu werden.
en_us: To meet and surpass your expectations for a belt that earns and not merely receives the label 'premium', each and every belt and buckle are hand-crafted from superior materials.

source: Andreas Felger weiß bereits mit 22 Jahren, dass für ihn der bürgerliche Weg zum beruflichen Erfolg mittels Hochdienen in hierarchischen Strukturen nicht in Frage kommt.
en_us: At 22, Andreas Felger has realized: Advancing obsequiously step by step up the corporate ladder, caught within a stultifying net of hierarchy, is just not an option for him.

source: Auf den zweiten Blick offenbart sich dann der Mut und absolute Formwillen; Man sieht die Details, gekonnt gelöst und eingepasst ins Ganze.
en_us: Its incredible daring and will to form only reveals itself at the second glance, details precipitating from clear shapes, only to unite with them once again.

source: Auf einer Messe lernt AF den Top-Gürtelmacher Ludwig Schröder kennen.
en_us: At an exhibition, Andreas Felger meets the belt-maker Ludwig Schröder.

source: CENTURION – Ausführung in Premium 4,5mm Kernleder doppelseitig genäht mit Verstärkungsseele vom Rind aus Europa.
en_us: The CENTURION: Fashioned from 4,5mm reinforced high-grade European cowhide leather.

source: Das Kernstück wird die Koppel.
en_us: The belt buckle is the heart of the design.

source: Das Leder kommt später hinzu.
en_us: The leather option is added later.

source: Das Original JET BELT® System
en_us: The inimitable JET BELT® System

source: Das besondere an der Koppel, AF nennt ihn lieber Verschluss, ist das System.
en_us: Its unique characteristic is the opening and closing mechanism.

source: Das einzigartige JET BELT® System beruht auf der Safetybelt-Funktion, die Sie als Standard in allen Passagierflugzeugen finden.
en_us: The unique JET BELT® System is based on Safety-Belt Technology, the very same that keeps you safe and comfortable on every flight.

source: Das macht uns besonders
en_us: Things that set us apart

source: Dazu kommt die stufenlose Verstellbarkeit, die ohne Löcher auskommt und unsichtbar im Verschluss integriert ist.
en_us: It also features seamless adjustment, concealed in the buckle and making a perforated, holey belt a thing of the past.

source: Denn Andreas Felger realisiert seine Vorstellung von einer gelungenen Form, die wuchtig, dabei jedoch elegant und hochwertig ist.
en_us: Andreas Felger will not rest until his vision of a shape that is both powerful and sophisticated has been made manifest.

source: Der Gürtel ist 115 cm lang und über die gesamte Länge stufenlos verstellbar.
en_us: 115 cm long, seamlessly adjustable along its entire length.

source: Der Gürtel lässt sich in Sekundenbruchteilen öffnen und wieder schließen, und genauso schnell durch einen anderen Verschluss ersetzen.
en_us: Through it, you can open and close the belt within milliseconds, and equally quickly and effortlessly swap the buckle.

source: Der Gürtel lässt sich in Sekundenbruchteilen öffnen und wieder schließen.
en_us: Open and close the belt within milliseconds.

source: Der Raum präsentiert sich selbstverständlich, glatt, wie aus einem Guss mit großer Leichtigkeit und Eleganz.
en_us: The space is sleek and solid. Its structure is elegant as if die-cast.

source: Der Tag kann beginnen.
en_us: You can seize the day.

source: Der Verschluss lässt sich mit einem Klick abnehmen – Den Gürtel können Sie daher sogar beim Security-Check am Flughafen anbehalten!
en_us: Remove the buckle with one click, keep your belt on and avoid uncomfortable fiddling at airport security!

source: Der einzigartige JET BELT® ist so konzipiert, dass er auch nach vielen Jahren noch seine Funktion behält.
en_us: Many years down the line, the JET BELT® will still ___ as the first time.

source: Die Idee JET BELT® hat eine lange Reise hinter sich und heute ist bereits die vierte Generation auf dem Markt.
en_us: The JET BELT® has come a long way - the current JET BELT® is already in its fourth generation.

source: Die Idee für JET BELT® wurde durch einen Klang geboren.
en_us: The idea for the JET BELT® was born through a sound:

source: Die besten Materialien:
en_us: High-grade materials

source: Die letzten Worte gehören dem JET BELT®:
en_us: Finally, the JET BELT®:

source: Die stufenlos verstellbare Länge passt sich ausserdem an Ihre Lebenssituation an!
en_us: No matter how your life changes, you can adjust the JET BELT®'s seamlessly adjustable length to fit your needs exactly.

source: Dies alles erfasst man nicht nur mit dem Verstand, am Ende spürt man etwas in sich.
en_us: Beyond all thinking, a feeling remains:

source: Dies ermöglicht den Kunden den Verschluss auszuwählen, den er gerade für sein Outfit möchte.
en_us: In this way, the wearer can pick the buckle that matches his outfit, mood, and style.

source: Drei Jahre dauert allein die Konstruktion des Koppels bis zur Produktionsreife.
en_us: Its development alone will take three years:

source: Ein Gefühl, eine Erinnerung.
en_us: A sensation, a memory.

source: Ein Klick Auf – Ein Klick Zu
en_us: One click to open, one click to shut

source: Einzgartiger 2-Step-Safetybelt Mechanismis – Klick-Auf, Klick-Zu in Sekundenbruchteilen.
en_us: Unique 2-Step Safety-Belt Mechanism - CLICK to open and close within milliseconds

source: Einzigartige Haptik und Sound, hochwertiger Klang beim Öffnen und Schließen der Gürtelschnalle.
en_us: Enjoy the sensory experience, the sound, and tactile sensation every time you open and close the buckle.

source: Er baut Messestände.
en_us: He assembles exhibition booths.

source: Er entwickelt für Bogner eine Handtasche mit automatischer Innenbeleuchtung.
en_us: For the fashion company Bogner, he develops a handbag with integrated lighting.

source: Er ist Rebell und Renegat und ein Kämpfer: Sein Ziel ist es, eine eigene Marke zu entwickeln, ein eigenes Produkt zu haben, mit dem er sich identifizieren kann, und das ihm gehört.
en_us: He knew himself to be a rebel, a renegade, a fighter: He needed to create a brand, a product, one to identify with, to own, to fashion as he saw fit.

source: Er kann Ludwig Schröder davon überzeugen, die Anfertigung der Ledergürtel zu übernehmen, es beginnt eine bis heute fruchtbare Kooperation.
en_us: He convinces Ludwig Schröder to manufacture the leather belts - and a long-lasting, mutually beneficial partnership begins.

source: Er musste allerdings für sich selbst herausfinden, was für ihn das Beste ist.
en_us: But in what way, in which area?

source: Er studiert Jura, arbeitet nachts in den angesagten Clubs der Münchner Technoszene, verdient gutes Geld und verwendet selbiges für die Entwicklung von Stahlrahmen für Bilder, er meldet ein Patent an, sucht Investoren , aber ergebnislos.
en_us: For this, he studies law, works in the hip and trendy Munich techno clubs, invests that money into the development of steel picture frames, files a patent, looks for investors, but to no avail.

source: Er verwandelt das an sich starre Sicherheitskoppel in eine fließende Form, die schön in der Hand liegt, mit leicht konvexen Flächen und dabei den wuchtigen Klang der Sicherheit behält.
en_us: He transforms the lifeless rigidity of the buckle into a dynamic shape of slightly rounded, convex surfaces, whose contrast does not detract but enhance the dark and heavy sound and weight of safety.

source: Es beruht auf der Safetybelt-Funktion, die Sie als Standard in allen Passagierflugzeugen finden.
en_us: It is based on Safety-Belt Technology, the very same that keeps you safe and comfortable on every flight.

source: Es galt, alles dafür einzusetzen.
en_us: This would be his herculean mission, the one he would pour his lifeblood into.

source: Es ist das sonore, fett-metallische und dunkle CLACK!, mit dem der Bügel des Sicherheitsverschlusses federnd im Koppelschloss einrastet.
en_us: The heavy, dark and metallic CLACK, produced by the closing of the airplane flap buckle.

source: Es ist der Klang der Entschlossenheit, das Signal, dass sich ein Zustand in sein Gegenteil verkehrt: offen – geschlossen, sicher – unsicher.
en_us: It is a decisive sound, marking the inversion of opposites: open - closed, safe - dangerous.

source: Folgen Sie uns auf Instagram
en_us: Follow us on Instagram!

source: Gemacht für die ganze Welt.
en_us: made for the world.

source: Genau das ist JET BELT®.
en_us: That's the JET BELT®.

source: Gürtelschnalle im Zink-Gussverfahren gefertigt für eine einzigartige Präzision der Einzelteile.
en_us: Die-cast zinc buckle to ensure matchless precision.

source: Handgefertigt in Deutschland.
en_us: Manufactured in Germany -

source: Handmade in Germany – kompromisslose Qualität für ein einzigartiges Erlebnis.
en_us: Handmade in Germany - superior quality for an incomparable experience.

source: Hält ein Leben lang:
en_us: A companion for life

source: Im Mai 2005 mietet Andreas Felger ein abgewohntes Apartment mit angeschlossenem Geschäftslokal im Münchener Schlachthofviertel, Adresse: Dreimühlenstraße 30. Er engagiert Architekten und Handwerker, erklärt ihnen im Detail seine Vorstellung von Wohnung und – vor allem – Laden, lässt bei der Umsetzung seiner Ideen keine Kompromisse zu, scheut weder Mühen noch Kosten, und eröffnet dort schließlich im März 2006 seinen eigenen JET BELT®-Store.
en_us: May 2005: Andreas Felger rents a worn-down apartment-shop-hybrid in Munich. To turn this future apartment and store in the Dreimühlenstraße 30 into the JET BELT®-Store, he hires architects and craftsmen. He will spare no expense, and permit no compromise, to see his vision of the JET BELT® store come to life. Finally, in March 2006, the JET BELT® store opens its gates for the first time.

source: In seiner spontanen und weltoffenen Art wird er einen sogleich in ein Gespräch verwickeln, und man kann sich in Ruhe alle Spielarten der Gürtel, die im Laufe des Projekts entwickelt wurden ansehen.
en_us: A thoroughly easy-going and cosmopolitan man, there is a high chance you'll find yourself chatting and looking at various versions and prototypes that the belt has gone through.

source: JET BELT® „Rebell, Renegat, Autodidakt“
en_us: JET BELT® - "Autodidact, rebel, renegade"

source: JET BELT® - System:
en_us: The JET BELT® System

source: JET BELT® MÜNCHEN
en_us: JET BELT® MUNICH

source: JET BELT® bekannt aus:
en_us: JET BELT® - as seen in

source: JET BELT® ist ein deutscher Hersteller von Premium Gürteln aus hochwertigsten Materialien.
en_us: JET BELT® is a German-based manufacturer of premium belts made from exquisite materials.

source: Kompromisslos hochwertig.
en_us: Superior quality without compromises.

source: Man bekommt einen köstlichen Kaffee und am Ende vergisst man die Zeit.
en_us: Over some delicious coffee, you'll be absorbed in his world.

source: Man ist bereit.
en_us: No matter what:

source: Man zieht ihn an, schließt den Verschluss –CLACK!
en_us: Put it on, close the buckle: CLACK!

source: Mit dem JET BELT®-Store realisiert Andreas Felger schließlich die äußere Entsprechung seines gesamten Strebens und Gestaltungswillens:
en_us: The JET BELT® store is this pursuit and creative drive made manifest:

source: Nach drei Jahren kommt der erste JET BELT® auf den Markt, damals nur mit Gurtband.
en_us: After three years in development, the first JET BELT® is born - for only featuring a webbing strap.

source: Neues aus unserem Lifestyle Blog
en_us: Get inspired on our lifestyle-blog

source: Prestige Magazin..........
en_us: Prestige Magazine

source: Sich einzugliedern und geduldig warten, bis man an die Reihe kommt, war für Ihn ausgeschlossen.
en_us: Patiently waiting his turn was out of the question.

source: Sie werden aus den besten Materialien handgefertigt um den Ansprüchen an einem Premium-Gürtel gerecht zu werden
en_us: To earn the label 'premium' and meet and surpass expectations, they are hand-crafted from superior materials.

source: Sollte man Gelegenheit haben, München zu besuchen, so lohnt sich auf jeden Fall ein kleiner Abstecher zu der JET BELT® - Home Base.
en_us: Should you be in Munich, it's worth stopping by the JET BELT® home base.

source: Sportlich und elegant zugleich – mit dem JET BELT® haben Sie immer das richtige Accessoire für ihr Outfit parat.
en_us: Athletic, but elegant - with the JET BELT® you'll always be dressed for the occasion.

source: Stufenlos Längenverstellbar
en_us: Seamlessly adjustable

source: Stufenlose Verstellbarkeit – unsichtbar im Verschluss integriert.
en_us: Seamless adjustment - camouflaged by the elegant buckle.

source: Unabhängig sein, Geld zum Leben verdienen, „DIE IDEE“ finden: Das ist die Aufgabe!
en_us: Sustenance, independence, discovering his idea- that's his challenge!

source: Und hier ist seine Geschichte.
en_us: And this is its story.

source: Unser einzigartiges System beruht auf der Safetybelt-Technik welche Ihnen das Öffnen und Schließen des Gürtels innerhalb von Sekundenbruchteilen ermöglicht.
en_us: Thanks to the unique Safety-Belt Technology, the belt opens and closes quickly and effortlessly within milliseconds.

source: Unser einzigartiges System sorgt für eine stufenlose Verstellbarkeit in allen Längen
en_us: Owing to this unique system, the belt is seamlessly adjustable - even down to a millimeter.

source: Von seinem Vater, der ein erfolgreicher Topmanager in der internationalen Gasbranche war, lernte er, von sich selbst das Beste zu verlangen und sich auch nur mit dem Bestmöglichen zufrieden zu geben.
en_us: His father, a successful top executive of an international corporation, had imparted in him the knowledge: He could and should do his best, needed to expect himself to do his best, and only ever be satisfied with the best possible performance.

source: Wenn man dort das Glück hat Andreas Felger anzutreffen, begegnet man einem großgewachsenen lässigen Mann, mit einem breiten und offenen Lachen im Gesicht.
en_us: If you have the pleasure of meeting Andreas Felger, you'll meet a tall, laid-back man with a wide, friendly smile.

source: Wenn man nicht das Glück hat in München wohnhaft zu sein ist jeder eingeladen sich auf der Website www.jetbelt.de zu informieren und sich seinen Lieblingsgürtel zu bestellen.
en_us: But even if you never have the pleasure of visiting Munich, you can get a taste of the JET BELT® showroom and choose your favorite belt at www.jetbelt.de.

source: Wenn man schließlich die Gesamtheit des Raumes erfasst hat, erkennt man das kreative Universum von Andreas Felger: Komplexe Technik und hochwertiges Handwerk in fließende Form und unbedingte Modernität gebracht, maximale Qualität des Materials und dabei eine schwebende Feinheit und Selbstverständlichkeit.
en_us: Taking in the whole space, his creative universe becomes apparent: sophisticated technology, magnificent materials, and exquisite craftsmanship, cast into flowing shapes, radiating unequivocal modernity. Here, a soaring refinement reveals itself as if obvious.

source: Wir setzen auf Nachhaltigkeit.
en_us: We value sustainability.

source: Zehn Jahre davor hatte ihn eine Idee erfasst, die sein Leben prägen und ihn um die halbe Welt treiben würde, und von der er, einmal überzeugt und entschlossen, niemals mehr abweichen sollte.
en_us: Ten years earlier, an idea had grabbed him. This idea would define his life and drive him to travel half the world. Nevertheless, he would not deviate from the path this idea had set for him.

source: Über uns:
en_us: About us:

source: – und fühlt sich sicher.
en_us: - you're ready.

source: „Rebell, Renegat, Autodidakt“ in the Prestige Magazin
en_us: Prestige Magazine: "Autodidact, rebel, renegade."
